/**
 Напишете речник от английски на български език.
Речникът (клас Dictionary) има методи:
- addTranslation(String wordEN, String wordBG)
- lookup(String wordEN): String (връща думата на
български език по зададена дума на английски
език)
- private init() – инициализира речникът с няколко
думи;
Извиквайте методът init() в конструктора на класа.
а) Напишете клас, в който ще тестваме речника с
main метод. Добавете преводи на няколко думи.

б) по въведени в конзолата думи на английски език,
изведете преводите им на български език
в) добавете метод, който по зададена дума на
български език връща съответната дума на
английски език
г) нашишете метод, който по дадена буква, връща
списък на всички думи на английски език от
речника, които започват с тази буква
 */
package Dictionary;