
//Нека е дадена библиотека с книги. Дефинирайте класове
//съответно за библиотека и книга. Библиотеката трябва да
//съдържа име и списък от книги. Книгите трябва да съдържат
//информация за заглавие, автор, издателство, година на
//издаване и ISBN-номер. В класа, който описва библиотека,
//добавете методи за добавяне на книга към библиотеката,
//търсене на книга по предварително зададен автор, извеждане
//на информация за дадена книга и изтриване на книга от
//библиотеката.
//- Напишете тестов клас, който създава обект от тип
//библиотека, добавя няколко книги към него и извежда
//информация за всяка една от тях. Имплементирайте тестова
//функционалност, която намира всички книги, чийто автор е
//Стивън Кинг и ги изтрива. Накрая, отново изведете
//информация за всяка една от оставащите книги.

package library;