/**
 Напишете структура на класове за система за работа с данни на
ученици. Всеки клас има следната информация:
- Номер на класа (може да бъде от типа „10а“)
- Номер на стая
- Класен ръководител (учител)
- Списък с ученици
- Списък с учители, които преподават на този клас
Учениците и учителите имат:
- Име и фамилия
- Дата на раждане
Всеки ученик има и среден успех. Всеки учител има години стаж.
а) Направете класовете за описаната структура
б) Напишете метод, който извежда средния успех на класа
в) Напишете метод, който извежда общите години стаж на
учителите, които преподават на този клас
г) Напишете метод, който извежда хората, които имат рожден ден
на дадена дата.
 */
package Students;